; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { ptr, ptr, ptr, ptr, ptr }
%struct.anon.0 = type { ptr, ptr, ptr, ptr, ptr }
%struct.anon.5 = type { ptr, ptr, ptr, ptr, ptr }
%struct.icmphdr_common = type { i8, i8, i16 }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.datarec = type { i64, i64 }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, %union.anon.1, i32, %union.anon.2, %union.anon.3, %union.anon.4, i16, i16, [6 x i8], [6 x i8] }
%union.anon.1 = type { i16 }
%union.anon.2 = type { i32 }
%union.anon.3 = type { [4 x i32] }
%union.anon.4 = type { [4 x i32] }

@xdp_icmp_echo_func.____fmt = internal constant [15 x i8] c"echo_reply: %d\00", align 1, !dbg !0
@redirect_params = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !258
@tx_port = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !240
@xdp_router_func.____fmt = internal constant [10 x i8] c"rc is %d\0A\00", align 1, !dbg !80
@xdp_router_func.____fmt.1 = internal constant [25 x i8] c"fib_params.dmac[%d]: %d\0A\00", align 1, !dbg !200

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 141, type: !331, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "xdp_icmp_echo_func", scope: !3, file: !3, line: 82, type: !4, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !306)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/nishanth/workspace/ebpf_workspace/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "8e6369c6de007f9049be8727ea14f52d")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !9, line: 5595, size: 192, elements: !10)
!9 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "689c3da77ac6e6dfcbd771fd6706f660")
!10 = !{!11, !15, !16, !17, !18, !19}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !8, file: !9, line: 5596, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !8, file: !9, line: 5597, baseType: !12, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !8, file: !9, line: 5598, baseType: !12, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !8, file: !9, line: 5600, baseType: !12, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !8, file: !9, line: 5601, baseType: !12, size: 32, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !8, file: !9, line: 5603, baseType: !12, size: 32, offset: 160)
!20 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 17.0.0 (https://github.com/llvm/llvm-project.git 41447f6fdfe4d67bbd130bc6035e66f3fa1ebeff)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !71, globals: !79, splitDebugInlining: false, nameTableKind: None)
!21 = !{!22, !29, !60}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !9, line: 5584, baseType: !14, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!25 = !DIEnumerator(name: "XDP_DROP", value: 1)
!26 = !DIEnumerator(name: "XDP_PASS", value: 2)
!27 = !DIEnumerator(name: "XDP_TX", value: 3)
!28 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 28, baseType: !14, size: 32, elements: !31)
!30 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "9a7f04155c254fef1b7ada5eb82c984c")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!32 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!33 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!34 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!35 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!36 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!37 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!38 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!39 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!40 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!41 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!42 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!43 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!44 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!45 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!46 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!47 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!48 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!49 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!50 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!51 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!52 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!53 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!54 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!55 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!56 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!57 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!58 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!59 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 6196, baseType: !14, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70}
!62 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_SUCCESS", value: 0)
!63 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_BLACKHOLE", value: 1)
!64 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNREACHABLE", value: 2)
!65 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_PROHIBIT", value: 3)
!66 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NOT_FWDED", value: 4)
!67 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FWD_DISABLED", value: 5)
!68 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNSUPP_LWT", value: 6)
!69 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NO_NEIGH", value: 7)
!70 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FRAG_NEEDED", value: 8)
!71 = !{!72, !73, !74, !76}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !13, line: 24, baseType: !75)
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !78, line: 27, baseType: !12)
!78 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!79 = !{!0, !80, !200, !205, !210, !213, !240, !258, !268, !277, !283, !288, !295, !300}
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "____fmt", scope: !82, file: !3, line: 279, type: !195, isLocal: true, isDefinition: true)
!82 = distinct !DISubprogram(name: "xdp_router_func", scope: !3, file: !3, line: 223, type: !4, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !83)
!83 = !{!84, !85, !86, !87, !129, !138, !170, !187, !188, !191, !192, !193, !194}
!84 = !DILocalVariable(name: "ctx", arg: 1, scope: !82, file: !3, line: 223, type: !7)
!85 = !DILocalVariable(name: "data_end", scope: !82, file: !3, line: 225, type: !72)
!86 = !DILocalVariable(name: "data", scope: !82, file: !3, line: 226, type: !72)
!87 = !DILocalVariable(name: "fib_params", scope: !82, file: !3, line: 227, type: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !9, line: 6208, size: 512, elements: !89)
!89 = !{!90, !93, !94, !96, !97, !102, !103, !109, !117, !122, !123, !124, !128}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !88, file: !9, line: 6212, baseType: !91, size: 8)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !13, line: 21, baseType: !92)
!92 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !88, file: !9, line: 6215, baseType: !91, size: 8, offset: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !88, file: !9, line: 6216, baseType: !95, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !78, line: 25, baseType: !74)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !88, file: !9, line: 6217, baseType: !95, size: 16, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !9, line: 6219, baseType: !98, size: 16, offset: 48)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !88, file: !9, line: 6219, size: 16, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !98, file: !9, line: 6221, baseType: !74, size: 16)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_result", scope: !98, file: !9, line: 6224, baseType: !74, size: 16)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !88, file: !9, line: 6229, baseType: !12, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !9, line: 6231, baseType: !104, size: 32, offset: 96)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !88, file: !9, line: 6231, size: 32, elements: !105)
!105 = !{!106, !107, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !104, file: !9, line: 6233, baseType: !91, size: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !104, file: !9, line: 6234, baseType: !77, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !104, file: !9, line: 6237, baseType: !12, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !9, line: 6240, baseType: !110, size: 128, offset: 128)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !88, file: !9, line: 6240, size: 128, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !110, file: !9, line: 6241, baseType: !77, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !110, file: !9, line: 6242, baseType: !114, size: 128)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 4)
!117 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !9, line: 6249, baseType: !118, size: 128, offset: 256)
!118 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !88, file: !9, line: 6249, size: 128, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !118, file: !9, line: 6250, baseType: !77, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !118, file: !9, line: 6251, baseType: !114, size: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !88, file: !9, line: 6255, baseType: !95, size: 16, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !88, file: !9, line: 6256, baseType: !95, size: 16, offset: 400)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !88, file: !9, line: 6257, baseType: !125, size: 48, offset: 416)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 48, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 6)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !88, file: !9, line: 6258, baseType: !125, size: 48, offset: 464)
!129 = !DILocalVariable(name: "eth", scope: !82, file: !3, line: 228, type: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !132, line: 169, size: 112, elements: !133)
!132 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "d4a01a1da3b79d23c796a4d8db749b8f")
!133 = !{!134, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !131, file: !132, line: 170, baseType: !135, size: 48)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 48, elements: !126)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !131, file: !132, line: 171, baseType: !135, size: 48, offset: 48)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !131, file: !132, line: 172, baseType: !95, size: 16, offset: 96)
!138 = !DILocalVariable(name: "ip6h", scope: !82, file: !3, line: 229, type: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !141, line: 117, size: 320, elements: !142)
!141 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "4a65c85349cc7a670732aecc94eade8f")
!142 = !{!143, !144, !145, !149, !150, !151, !152, !169}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !140, file: !141, line: 119, baseType: !91, size: 4, flags: DIFlagBitField, extraData: i64 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !140, file: !141, line: 120, baseType: !91, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !140, file: !141, line: 127, baseType: !146, size: 24, offset: 8)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 24, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 3)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !140, file: !141, line: 129, baseType: !95, size: 16, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !140, file: !141, line: 130, baseType: !91, size: 8, offset: 48)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !140, file: !141, line: 131, baseType: !91, size: 8, offset: 56)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !140, file: !141, line: 133, baseType: !153, size: 128, offset: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !154, line: 33, size: 128, elements: !155)
!154 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !153, file: !154, line: 40, baseType: !157, size: 128)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !153, file: !154, line: 34, size: 128, elements: !158)
!158 = !{!159, !163, !167}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !157, file: !154, line: 35, baseType: !160, size: 128)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !157, file: !154, line: 37, baseType: !164, size: 128)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 128, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !157, file: !154, line: 38, baseType: !168, size: 128)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !115)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !140, file: !141, line: 134, baseType: !153, size: 128, offset: 192)
!170 = !DILocalVariable(name: "iph", scope: !82, file: !3, line: 230, type: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !173, line: 86, size: 160, elements: !174)
!173 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "91bb7f0ed6560290b754374efff83769")
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !185, !186}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !172, file: !173, line: 88, baseType: !91, size: 4, flags: DIFlagBitField, extraData: i64 0)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !172, file: !173, line: 89, baseType: !91, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !172, file: !173, line: 96, baseType: !91, size: 8, offset: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !172, file: !173, line: 97, baseType: !95, size: 16, offset: 16)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !172, file: !173, line: 98, baseType: !95, size: 16, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !172, file: !173, line: 99, baseType: !95, size: 16, offset: 48)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !172, file: !173, line: 100, baseType: !91, size: 8, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !172, file: !173, line: 101, baseType: !91, size: 8, offset: 72)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !172, file: !173, line: 102, baseType: !184, size: 16, offset: 80)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !78, line: 31, baseType: !74)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !172, file: !173, line: 103, baseType: !77, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !172, file: !173, line: 104, baseType: !77, size: 32, offset: 128)
!187 = !DILocalVariable(name: "h_proto", scope: !82, file: !3, line: 231, type: !74)
!188 = !DILocalVariable(name: "nh_off", scope: !82, file: !3, line: 232, type: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !13, line: 31, baseType: !190)
!190 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!191 = !DILocalVariable(name: "rc", scope: !82, file: !3, line: 233, type: !6)
!192 = !DILocalVariable(name: "i", scope: !82, file: !3, line: 233, type: !6)
!193 = !DILocalVariable(name: "action", scope: !82, file: !3, line: 234, type: !6)
!194 = !DILabel(scope: !82, name: "out", file: !3, line: 311)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 80, elements: !198)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!198 = !{!199}
!199 = !DISubrange(count: 10)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "____fmt", scope: !82, file: !3, line: 292, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 200, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 25)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "____fmt", scope: !82, file: !3, line: 294, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 16, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 2)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "_license", scope: !20, file: !3, line: 321, type: !212, isLocal: false, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 32, elements: !115)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !20, file: !215, line: 22, type: !216, isLocal: false, isDefinition: true)
!215 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/nishanth/workspace/ebpf_workspace/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "c978ba00f7b9781ed1e135fd8557e600")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 16, size: 320, elements: !217)
!217 = !{!218, !221, !223, !230, !235}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !215, line: 17, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, elements: !126)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !216, file: !215, line: 18, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !216, file: !215, line: 19, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !226, line: 10, size: 128, elements: !227)
!226 = !DIFile(filename: "./../common/xdp_stats_kern_user.h", directory: "/home/nishanth/workspace/ebpf_workspace/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "96c2435685fa7da2d24f219444d8659d")
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !225, file: !226, line: 11, baseType: !189, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !225, file: !226, line: 12, baseType: !189, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !216, file: !215, line: 20, baseType: !231, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 5)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !216, file: !215, line: 21, baseType: !236, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 1)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "tx_port", scope: !20, file: !3, line: 24, type: !242, isLocal: false, isDefinition: true)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 18, size: 320, elements: !243)
!243 = !{!244, !249, !251, !252, !257}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !3, line: 19, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 448, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 14)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !242, file: !3, line: 20, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !242, file: !3, line: 21, baseType: !250, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !242, file: !3, line: 22, baseType: !253, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8192, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !242, file: !3, line: 23, baseType: !236, size: 64, offset: 256)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "redirect_params", scope: !20, file: !3, line: 33, type: !260, isLocal: false, isDefinition: true)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 27, size: 320, elements: !261)
!261 = !{!262, !263, !265, !266, !267}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !3, line: 28, baseType: !236, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !260, file: !3, line: 29, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !260, file: !3, line: 30, baseType: !264, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !260, file: !3, line: 31, baseType: !236, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !260, file: !3, line: 32, baseType: !236, size: 64, offset: 256)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !20, file: !270, line: 794, type: !271, isLocal: true, isDefinition: true)
!270 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/nishanth/workspace/ebpf_workspace/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "7422ca06c9dc86eba2f268a57d8acf2f")
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !76, !12, !76, !12, !276}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !13, line: 30, baseType: !275)
!275 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !78, line: 32, baseType: !12)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !20, file: !270, line: 177, type: !279, isLocal: true, isDefinition: true)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!73, !282, !12, null}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !20, file: !270, line: 619, type: !285, isLocal: true, isDefinition: true)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!73, !12, !189}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !20, file: !270, line: 56, type: !290, isLocal: true, isDefinition: true)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!72, !72, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !20, file: !270, line: 1323, type: !297, isLocal: true, isDefinition: true)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!73, !72, !189, !189}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !20, file: !270, line: 1856, type: !302, isLocal: true, isDefinition: true)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!73, !72, !305, !6, !12}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!306 = !{!307, !308, !309, !310, !315, !316, !317, !318, !319, !320, !321, !322, !329, !330}
!307 = !DILocalVariable(name: "ctx", arg: 1, scope: !2, file: !3, line: 82, type: !7)
!308 = !DILocalVariable(name: "data_end", scope: !2, file: !3, line: 84, type: !72)
!309 = !DILocalVariable(name: "data", scope: !2, file: !3, line: 85, type: !72)
!310 = !DILocalVariable(name: "nh", scope: !2, file: !3, line: 86, type: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !312, line: 33, size: 64, elements: !313)
!312 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/nishanth/workspace/ebpf_workspace/xdp-tutorial/packet03-redirecting", checksumkind: CSK_MD5, checksum: "172efdd203783aed49c0ce78645261a8")
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !311, file: !312, line: 34, baseType: !72, size: 64)
!315 = !DILocalVariable(name: "eth", scope: !2, file: !3, line: 87, type: !130)
!316 = !DILocalVariable(name: "eth_type", scope: !2, file: !3, line: 88, type: !6)
!317 = !DILocalVariable(name: "ip_type", scope: !2, file: !3, line: 89, type: !6)
!318 = !DILocalVariable(name: "icmp_type", scope: !2, file: !3, line: 90, type: !6)
!319 = !DILocalVariable(name: "iphdr", scope: !2, file: !3, line: 91, type: !171)
!320 = !DILocalVariable(name: "ipv6hdr", scope: !2, file: !3, line: 92, type: !139)
!321 = !DILocalVariable(name: "echo_reply", scope: !2, file: !3, line: 93, type: !74)
!322 = !DILocalVariable(name: "icmphdr", scope: !2, file: !3, line: 94, type: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr_common", file: !312, line: 51, size: 32, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !312, line: 52, baseType: !91, size: 8)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !324, file: !312, line: 53, baseType: !91, size: 8, offset: 8)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !324, file: !312, line: 54, baseType: !184, size: 16, offset: 16)
!329 = !DILocalVariable(name: "action", scope: !2, file: !3, line: 95, type: !12)
!330 = !DILabel(scope: !2, name: "out", file: !3, line: 145)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 120, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 15)
!334 = !{i32 7, !"Dwarf Version", i32 5}
!335 = !{i32 2, !"Debug Info Version", i32 3}
!336 = !{i32 1, !"wchar_size", i32 4}
!337 = !{i32 7, !"frame-pointer", i32 2}
!338 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!339 = !{!"clang version 17.0.0 (https://github.com/llvm/llvm-project.git 41447f6fdfe4d67bbd130bc6035e66f3fa1ebeff)"}
!340 = distinct !DIAssignID()
!341 = distinct !DIAssignID()
!342 = distinct !DIAssignID()
!343 = !DILocation(line: 0, scope: !2)
!344 = !DILocation(line: 84, column: 38, scope: !2)
!345 = !{!346, !347, i64 4}
!346 = !{!"xdp_md", !347, i64 0, !347, i64 4, !347, i64 8, !347, i64 12, !347, i64 16, !347, i64 20}
!347 = !{!"int", !348, i64 0}
!348 = !{!"omnipotent char", !349, i64 0}
!349 = !{!"Simple C/C++ TBAA"}
!350 = !DILocation(line: 84, column: 27, scope: !2)
!351 = !DILocation(line: 84, column: 19, scope: !2)
!352 = !DILocation(line: 85, column: 34, scope: !2)
!353 = !{!346, !347, i64 0}
!354 = !DILocation(line: 85, column: 23, scope: !2)
!355 = !DILocation(line: 85, column: 15, scope: !2)
!356 = !DILocalVariable(name: "nh", arg: 1, scope: !357, file: !312, line: 124, type: !360)
!357 = distinct !DISubprogram(name: "parse_ethhdr", scope: !312, file: !312, line: 124, type: !358, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !362)
!358 = !DISubroutineType(types: !359)
!359 = !{!6, !360, !72, !361}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!362 = !{!356, !363, !364}
!363 = !DILocalVariable(name: "data_end", arg: 2, scope: !357, file: !312, line: 125, type: !72)
!364 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !357, file: !312, line: 126, type: !361)
!365 = !DILocation(line: 0, scope: !357, inlinedAt: !366)
!366 = distinct !DILocation(line: 101, column: 13, scope: !2)
!367 = !DILocalVariable(name: "nh", arg: 1, scope: !368, file: !312, line: 79, type: !360)
!368 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !312, file: !312, line: 79, type: !369, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !376)
!369 = !DISubroutineType(types: !370)
!370 = !{!6, !360, !72, !361, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !312, line: 64, size: 32, elements: !373)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !372, file: !312, line: 65, baseType: !375, size: 32)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !208)
!376 = !{!367, !377, !378, !379, !380, !381, !382, !388, !389}
!377 = !DILocalVariable(name: "data_end", arg: 2, scope: !368, file: !312, line: 80, type: !72)
!378 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !368, file: !312, line: 81, type: !361)
!379 = !DILocalVariable(name: "vlans", arg: 4, scope: !368, file: !312, line: 82, type: !371)
!380 = !DILocalVariable(name: "eth", scope: !368, file: !312, line: 84, type: !130)
!381 = !DILocalVariable(name: "hdrsize", scope: !368, file: !312, line: 85, type: !6)
!382 = !DILocalVariable(name: "vlh", scope: !368, file: !312, line: 86, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !312, line: 42, size: 32, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !384, file: !312, line: 43, baseType: !95, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !384, file: !312, line: 44, baseType: !95, size: 16, offset: 16)
!388 = !DILocalVariable(name: "h_proto", scope: !368, file: !312, line: 87, type: !74)
!389 = !DILocalVariable(name: "i", scope: !368, file: !312, line: 88, type: !6)
!390 = !DILocation(line: 0, scope: !368, inlinedAt: !391)
!391 = distinct !DILocation(line: 129, column: 9, scope: !357, inlinedAt: !366)
!392 = !DILocation(line: 93, column: 14, scope: !393, inlinedAt: !391)
!393 = distinct !DILexicalBlock(scope: !368, file: !312, line: 93, column: 6)
!394 = !DILocation(line: 93, column: 24, scope: !393, inlinedAt: !391)
!395 = !DILocation(line: 93, column: 6, scope: !368, inlinedAt: !391)
!396 = !DILocation(line: 99, column: 17, scope: !368, inlinedAt: !391)
!397 = !{!398, !398, i64 0}
!398 = !{!"short", !348, i64 0}
!399 = !DILocalVariable(name: "h_proto", arg: 1, scope: !400, file: !312, line: 68, type: !74)
!400 = distinct !DISubprogram(name: "proto_is_vlan", scope: !312, file: !312, line: 68, type: !401, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !403)
!401 = !DISubroutineType(types: !402)
!402 = !{!6, !74}
!403 = !{!399}
!404 = !DILocation(line: 0, scope: !400, inlinedAt: !405)
!405 = distinct !DILocation(line: 106, column: 8, scope: !406, inlinedAt: !391)
!406 = distinct !DILexicalBlock(scope: !407, file: !312, line: 106, column: 7)
!407 = distinct !DILexicalBlock(scope: !408, file: !312, line: 105, column: 39)
!408 = distinct !DILexicalBlock(scope: !409, file: !312, line: 105, column: 2)
!409 = distinct !DILexicalBlock(scope: !368, file: !312, line: 105, column: 2)
!410 = !DILocation(line: 70, column: 20, scope: !400, inlinedAt: !405)
!411 = !DILocation(line: 70, column: 46, scope: !400, inlinedAt: !405)
!412 = !DILocation(line: 106, column: 7, scope: !407, inlinedAt: !391)
!413 = !DILocation(line: 112, column: 18, scope: !407, inlinedAt: !391)
!414 = !DILocation(line: 102, column: 6, scope: !2)
!415 = !DILocalVariable(name: "nh", arg: 1, scope: !416, file: !312, line: 151, type: !360)
!416 = distinct !DISubprogram(name: "parse_iphdr", scope: !312, file: !312, line: 151, type: !417, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !420)
!417 = !DISubroutineType(types: !418)
!418 = !{!6, !360, !72, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!420 = !{!415, !421, !422, !423, !424}
!421 = !DILocalVariable(name: "data_end", arg: 2, scope: !416, file: !312, line: 152, type: !72)
!422 = !DILocalVariable(name: "iphdr", arg: 3, scope: !416, file: !312, line: 153, type: !419)
!423 = !DILocalVariable(name: "iph", scope: !416, file: !312, line: 155, type: !171)
!424 = !DILocalVariable(name: "hdrsize", scope: !416, file: !312, line: 156, type: !6)
!425 = !DILocation(line: 0, scope: !416, inlinedAt: !426)
!426 = distinct !DILocation(line: 103, column: 13, scope: !427)
!427 = distinct !DILexicalBlock(scope: !428, file: !3, line: 102, column: 39)
!428 = distinct !DILexicalBlock(scope: !2, file: !3, line: 102, column: 6)
!429 = !DILocation(line: 158, column: 10, scope: !430, inlinedAt: !426)
!430 = distinct !DILexicalBlock(scope: !416, file: !312, line: 158, column: 6)
!431 = !DILocation(line: 158, column: 14, scope: !430, inlinedAt: !426)
!432 = !DILocation(line: 158, column: 6, scope: !416, inlinedAt: !426)
!433 = !DILocation(line: 161, column: 17, scope: !416, inlinedAt: !426)
!434 = !DILocation(line: 161, column: 21, scope: !416, inlinedAt: !426)
!435 = !DILocation(line: 163, column: 13, scope: !436, inlinedAt: !426)
!436 = distinct !DILexicalBlock(scope: !416, file: !312, line: 163, column: 5)
!437 = !DILocation(line: 163, column: 5, scope: !416, inlinedAt: !426)
!438 = !DILocation(line: 167, column: 14, scope: !439, inlinedAt: !426)
